docs/performance/optimization-20250221/baseline_multi.log
Running 1m test @ http://localhost:8080/points/consume
  4 threads and 500 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency   328.36ms   66.73ms 897.47ms   90.57%
    Req/Sec   188.30     47.05   320.00     64.57%
  45058 requests in 1.00m, 8.47MB read
  Socket errors: connect 253, read 0, write 0, timeout 0
Requests/sec:    749.72
Transfer/sec:    144.31KB